[Killed] Block removal mutation
repos/TestStriker/TestStriker/Utils.cs:6:9
     public class Utils
     {
         public int Sum(int a, int b)
-        {
-            Log("Sum");
-            return a + b;
-        }
+        {}
 
         public int Increment(int a)

[Survived] Statement mutation
repos/TestStriker/TestStriker/Utils.cs:7:13
     {
         public int Sum(int a, int b)
         {
-            Log("Sum");
+            ;
             return a + b;
         }

[Killed] Arithmetic mutation
repos/TestStriker/TestStriker/Utils.cs:8:20
         public int Sum(int a, int b)
         {
             Log("Sum");
-            return a + b;
+            return a - b;
         }
 

[Killed] Block removal mutation
repos/TestStriker/TestStriker/Utils.cs:12:9
         }
 
         public int Increment(int a)
-        {
-            Log("Increment");
-            a += 1;
-            return a;
-        }
+        {}
 
         public bool Compare(int a, int b)

[Survived] Statement mutation
repos/TestStriker/TestStriker/Utils.cs:13:13
 
         public int Increment(int a)
         {
-            Log("Increment");
+            ;
             a += 1;
             return a;

[Killed] String mutation
repos/TestStriker/TestStriker/Utils.cs:13:17
 
         public int Increment(int a)
         {
-            Log("Increment");
+            Log("");
             a += 1;
             return a;

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
repos/TestStriker/TestStriker/Utils.cs:14:13
         public int Increment(int a)
         {
             Log("Increment");
-            a += 1;
+            a -= 1;
             return a;
         }

[Killed] Block removal mutation
repos/TestStriker/TestStriker/Utils.cs:19:9
         }
 
         public bool Compare(int a, int b)
-        {
-            if(a == b) return true;
-            
-            return false;
-        }
+        {}
 
         public int LastItem(IList<int> list)

[Killed] Boolean mutation
repos/TestStriker/TestStriker/Utils.cs:20:31
 
         public bool Compare(int a, int b)
         {
-            if(a == b) return true;
+            if(a == b) return false;
             
             return false;

[Killed] Equality mutation
repos/TestStriker/TestStriker/Utils.cs:20:16
 
         public bool Compare(int a, int b)
         {
-            if(a == b) return true;
+            if(a != b) return true;
             
             return false;

[Killed] Block removal mutation
repos/TestStriker/TestStriker/Utils.cs:26:9
         }
 
         public int LastItem(IList<int> list)
-        {
-            return list.Last();
-        }
+        {}
 
         public void Log(string message)

[Killed] Linq method mutation (Last() to First())
repos/TestStriker/TestStriker/Utils.cs:27:20
 
         public int LastItem(IList<int> list)
         {
-            return list.Last();
+            return list.First();
         }
 

[Killed] Block removal mutation
repos/TestStriker/TestStriker/Utils.cs:31:9
         }
 
         public void Log(string message)
-        {
-
-            if(string.IsNullOrWhiteSpace(message)) throw new ArgumentNullException("Null value");
-
-            Console.WriteLine(message);
-        }
+        {}
     }
 }

[Killed] Statement mutation
repos/TestStriker/TestStriker/Utils.cs:33:52
         public void Log(string message)
         {
 
-            if(string.IsNullOrWhiteSpace(message)) throw new ArgumentNullException("Null value");
+            if(string.IsNullOrWhiteSpace(message)) ;
 
             Console.WriteLine(message);

[Killed] Negate expression
repos/TestStriker/TestStriker/Utils.cs:33:16
         public void Log(string message)
         {
 
-            if(string.IsNullOrWhiteSpace(message)) throw new ArgumentNullException("Null value");
+            if(!(string.IsNullOrWhiteSpace(message))) throw new ArgumentNullException("Null value");
 
             Console.WriteLine(message);

[Survived] Statement mutation
repos/TestStriker/TestStriker/Utils.cs:35:13
 
             if(string.IsNullOrWhiteSpace(message)) throw new ArgumentNullException("Null value");
 
-            Console.WriteLine(message);
+            ;
         }
     }
